import math

print("=== โปรแกรมคำนวณพื้นที่รูปทรงเรขาคณิต ===")

while True:
    print("\n1. สี่เหลี่ยมมุมฉาก")
    print("2. วงกลม")
    print("3. สามเหลี่ยม")
    print("4. ออกจากโปรแกรม")

    เลือก = input("เลือกเมนู: ")

    if เลือก == "1":
        กว้าง = float(input("ความกว้าง: "))
        ยาว = float(input("ความยาว: "))
        print("พื้นที่ =", กว้าง * ยาว)

    elif เลือก == "2":
        r = float(input("รัศมี: "))
        print("พื้นที่ =", math.pi * r**2)

    elif เลือก == "3":
        ฐาน = float(input("ความยาวฐาน: "))
        สูง = float(input("ความสูง: "))
        print("พื้นที่ =", 0.5 * ฐาน * สูง)

    elif เลือก == "4":
        print("จบการทำงาน")
        break

    else:
        print("กรุณาเลือกเมนูให้ถูกต้อง")